## Pandas Kütüphaneler
## 1- df.info()
DataFrame hakkında genel bilgi verir (sütun sayısı, veri tipi, boş değerler vb.).

In [5]:
import pandas as pd

In [7]:
df = pd.read_csv("Chocolate Sales.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1094 entries, 0 to 1093
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Sales Person   1094 non-null   object
 1   Country        1094 non-null   object
 2   Product        1094 non-null   object
 3   Date           1094 non-null   object
 4   Amount         1094 non-null   object
 5   Boxes Shipped  1094 non-null   int64
dtypes: int64(1), object(5)
memory usage: 51.4+ KB

## 2- df.describe()
Sayısal veri üzerinde temel istatistiksel bilgileri (ortalama, medyan, standart sapma, min, max vb.) sağlar.

In [11]:
df.describe()

       Boxes Shipped
count    1094.000000
mean      161.797989
std       121.544145
min         1.000000
25%        70.000000
50%       135.000000
75%       228.750000
max       709.000000

## 3- df.drop
Verilen satır veya sütunları DataFrame'den siler.

In [15]:
df.drop("Country", axis=1)

,Sales Person,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,Peanut Butter Cubes,24-Feb-22,"$13,685",184
...,...,...,...,...,...
1089,Karlen McCaffrey,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,70% Dark Bites,23-May-22,"$5,075",344

## 4-df.sort_values()
Verileri belirli bir sütuna göre sıralar.

In [19]:
df_sorted = df.sort_values("Date", ascending=False)  # Azalan sırayla sıralar

## 5- pd.read_csv()
CSV dosyasını okumak için kullanılır.

In [22]:
df = pd.read_csv("Chocolate Sales.csv")
df.head()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184

## 6- df.head()
DataFrame'in ilk birkaç satırını gösterir.

In [23]:
df.head(7)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184
5,Van Tuxwell,India,Smooth Sliky Salty,06-Jun-22,"$5,376",38
6,Oby Sorrel,UK,99% Dark & Pure,25-Jan-22,"$13,685",176

## 7-df.tail
DataFrame'in son birkaç satırını gösterir.

In [26]:
df.tail(12)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
1082,Brien Boise,USA,Raspberry Choco,12-Jan-22,$672,194
1083,Madelene Upcott,New Zealand,Milk Bars,29-Mar-22,"$12,558",403
1084,Roddy Speechley,India,50% Dark Bites,14-Mar-22,"$8,337",12
1085,Barr Faughny,New Zealand,99% Dark & Pure,24-May-22,"$8,134",195
1086,Dennison Crosswaite,Canada,Organic Choco Syrup,28-Jan-22,"$8,491",75
1087,Beverie Moffet,India,Almond Choco,24-May-22,"$3,066",96
1088,Brien Boise,Australia,Peanut Butter Cubes,19-Aug-22,$301,205
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

## 8- df.isnull()
Boş değerleri tespit etmek için kullanılır. Bir DataFrame üzerinde hangi hücrelerin boş olduğunu kontrol eder.

In [27]:
df.isnull().sum()

Sales Person     0
Country          0
Product          0
Date             0
Amount           0
Boxes Shipped    0
dtype: int64

## 9- df['column']
Belirli bir kolonu seçmek için kullanılır.

In [29]:
df['Country']

0              UK
1           India
2           India
3       Australia
4              UK
          ...
1089    Australia
1090          USA
1091       Canada
1092        India
1093        India
Name: Country, Length: 1094, dtype: object

## 10 - df['column'].mean()
Belirli bir kolonun ortalamasını almak için kullanılır. String gibi veri tiplerinde error verir.

In [32]:
df['Boxes Shipped'].mean()

np.float64(161.7979890310786)

## 11 - df['column'].max()
Belirli bir kolonun maksimum değerini almak için kullanılır.

In [33]:
df['Boxes Shipped'].max()

np.int64(709)